'''
Код Морзе для представления цифр и букв использует тире и точки.

Напишите программу для кодирования текстового сообщения в соответствии 
с кодом Морзе.

На вход программе подается одна строка – текстовое сообщение.

Программа должна вывести закодированное с помощью кода Морзе сообщение, 
оставляя пробел между каждым закодированным символом 
(последовательностью тире и точек).
'''
# 1 вариант
morze = {'A':'.-', 'B':'-...', 'C':'-.-.', 'D':'-..', 'E':'.', 'F':'..-.',
         'G':'--.', 'H':'....', 'I':'..', 'J':'.---', 'K':'-.-', 'L':'.-..',
         'M':'--', 'N':'-.', 'O':'---', 'P':'.--.', 'Q':'--.-', 'R':'.-.',
         'S':'...', 'T':'-', 'U':'..-', 'V':'...-', 'W':'.--', 'X':'-..-',
         'Y':'-.--', 'Z':'--..', '0':'-----', '1':'.----', '2':'..---', 
         '3':'...--', '4':'....-', '5':'.....', '6':'-....', '7':'--...', 
         '8':'---..', '9':'----.'}

# 2 вариант
let = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', 
         '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', 
         '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', 
         '-.--', '--..', '-----', '.----', '..---', '...--', '....-', 
         '.....', '-....', '--...', '---..', '----.']

# через словарь по 2 варианту
# morze = dict(zip(let, morse))     # запаковка списков в словарь

# через словарь по 1 варианту
text = input().upper().replace("",'')
res = []
for letter in text:
    if letter in morze:
        res.append(morze[letter])
print(*res)


# через списки по 2 варианту
res1 = []
for i in text:
    if i in let:
        res1.append(morse[let.index(i)])
print(*res1)